# PrintParameters Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IPrintSetting..::..PrintParameters Property
IPrintSetting Interface See Also
---
Returns the Parameters of Print Setup.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
PrintParameters PrintParameters { get; }
```

Visual Basic
---
```text
ReadOnly Property PrintParameters As PrintParameters
	Get
```

Visual C++
---
```text
property PrintParameters^ PrintParameters {
	PrintParameters^ get ();
}
```

# Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.
# See Also
IPrintSetting Interface
Autodesk.Revit.DB Namespace